app/controllers/api/friendships_controller.rb

  def create
    @follow = Friendship.new(friendship_params)
  if @follow.save
---
INSERT INTO "friendships" ("requester_id", "requested_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["requester_id", 11], ["requested_id", 11], ["created_at", "2021-04-13 09:45:58.948145"], ["updated_at", "2021-04-13 09:45:58.948145"]]