app/controllers/api/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["author_id", 7], ["id", 12], ["LIMIT", 1]]
---
  def index
    @posts = if params[:user_id]
              Post.where(author_id: params[:user_id])