app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "sdhasdhjkas"], ["author_id", 7], ["created_at", "2021-04-12 02:04:27.181203"], ["updated_at", "2021-04-12 02:04:27.181203"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save

UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "uhhhhhh"], ["updated_at", "2021-04-12 02:30:36.578068"], ["id", 16]]
---
  def update
    @post = current_user.posts.find_by(id: params[:id])

    if @post && @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 11]]
---
  def destroy
    @post = current_user.posts.find_by(id: params[:id])

    if @post && @post.destroy