app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "birthday", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
      @user = User.new(user_params)

      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "birthday" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["birthday", "1111-12-02"], ["updated_at", "2021-04-12 04:37:22.598679"], ["id", 8]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)