app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "MphYQetl07A4NFPnSebdmg=="], ["updated_at", "2021-04-11 21:05:00.276516"], ["id", 7]]
---
    def reset_session_token
        self.session_token = SecureRandom.base64
        self.save!